app/Controllers/API/ChallengeHarian.php

    public function index()
    {
        $data = $this->challengeHarianModel->findAll();
---
SELECT *
FROM `challenge_harian`

    public function join()
    {
        $validation = $this->validate([
            'challenge_id' => 'required',
            "user_id" => "required",
        ]);

        if (!$validation) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $challengeData = [
            'challenge_id' => $this->request->getPost('challenge_id'),
            'user_id'   => $this->request->getPost('user_id'),
            'type'  => 'harian'
        ];

        $challenge_ongoing_id = $this->onGoingChallengeModel->insert($challengeData);
---
INSERT INTO `ongoing_challenge` (`challenge_id`, `user_id`) VALUES ('3', '1')

    public function getAllOngoingChallengeHarian()
    {
        $validation = $this->validate([
            'user_id' => 'required'
        ]);

        if (!$validation) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = $this->onGoingChallengeModel->where('ongoing_challenge.user_id', $this->request->getVar('user_id'))->join('challenge_harian', 'challenge_harian.id = ongoing_challenge.challenge_id')->findAll();
---
SELECT *
FROM `ongoing_challenge`
JOIN `challenge_harian` ON `challenge_harian`.`id` = `ongoing_challenge`.`challenge_id`
WHERE `ongoing_challenge`.`user_id` = '1'