app/Controllers/API/ChallengeBertahap.php

SELECT *
FROM `ongoing_challenge`
JOIN `challenge_harian` ON `challenge_harian`.`id` = `ongoing_challenge`.`challenge_id`
WHERE `ongoing_challenge`.`user_id` = '1'
AND `ongoing_challenge`.`type` = 'bertahap'
---
    public function getAllOngoingChallengeBertahap()
    {
        $validation = $this->validate([
            'user_id' => 'required'
        ]);

        if (!$validation) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $data = $this->onGoingChallengeModel->where('ongoing_challenge.user_id', $this->request->getVar('user_id'))->where('ongoing_challenge.type', 'bertahap')->join('challenge_harian', 'challenge_harian.id = ongoing_challenge.challenge_id')->findAll();